ArakniD/Lion-IRVT/Hardware/source/tida-010086/bts_F2837xD_8ch/registers.c
/*
 * registers.c
 *
 *  Created on: 15 Apr. 2025
 *      Author: lucas
 */

#include "driverlib.h"
#include "device.h"
#include "registers.h"
#include "led_driver.h"
#include <string.h>
#include <stdlib.h>

//
// Shared data placement. The F2837xD message RAMs are single-writer:
// CPU2TOCPU1RAM is writable only by CPU2, CPU1TOCPU2RAM only by CPU1.
//

//
// CPU2 -> CPU1. CPU2 owns the register file; CPU1 only ever reads it.
//
#pragma DATA_SECTION(registers, "CPU2TOCPU1RAM")
volatile float32_t registers[TOTAL_REGISTERS];

#pragma DATA_SECTION(ipcMsg, "CPU2TOCPU1RAM")
volatile BTS_ipcMessage ipcMsg;

#pragma DATA_SECTION(calibrationData, "CPU2TOCPU1RAM")
volatile BTS_channelCalibration calibrationData[NUM_CHANNELS];

//
// CPU1 -> CPU2. CPU1 publishes measurements and status here; CPU2 mirrors
// them into registers[] for the external interfaces.
//
#pragma DATA_SECTION(canData, "CPU1TOCPU2RAM")
volatile CAN_data canData[NUM_CHANNELS];

#pragma DATA_SECTION(cpu1Status, "CPU1TOCPU2RAM")
volatile BTS_cpu1Status cpu1Status;

#pragma DATA_SECTION(startup_mode, "CPU1TOCPU2RAM")
volatile uint32_t startup_mode;

#pragma DATA_SECTION(startup_enable, "CPU1TOCPU2RAM")
volatile uint32_t startup_enable;

const RegisterConfig regConfig[TOTAL_REGISTERS] = {
    // Channel 0
    {eCh0_Mode, REG_ACCESS_RW, 4}, {eCh0_ChargeVoltageMin, REG_ACCESS_RW, 4}, {eCh0_ChargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh0_DischargeVoltageMin, REG_ACCESS_RW, 4}, {eCh0_DischargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh0_ChargeCurrentMin, REG_ACCESS_RW, 4}, {eCh0_ChargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh0_DischargeCurrentMin, REG_ACCESS_RW, 4}, {eCh0_DischargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh0_Status, REG_ACCESS_RO, 4},
    // Channel 1
    {eCh1_Mode, REG_ACCESS_RW, 4}, {eCh1_ChargeVoltageMin, REG_ACCESS_RW, 4}, {eCh1_ChargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh1_DischargeVoltageMin, REG_ACCESS_RW, 4}, {eCh1_DischargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh1_ChargeCurrentMin, REG_ACCESS_RW, 4}, {eCh1_ChargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh1_DischargeCurrentMin, REG_ACCESS_RW, 4}, {eCh1_DischargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh1_Status, REG_ACCESS_RO, 4},
    // Channel 2
    {eCh2_Mode, REG_ACCESS_RW, 4}, {eCh2_ChargeVoltageMin, REG_ACCESS_RW, 4}, {eCh2_ChargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh2_DischargeVoltageMin, REG_ACCESS_RW, 4}, {eCh2_DischargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh2_ChargeCurrentMin, REG_ACCESS_RW, 4}, {eCh2_ChargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh2_DischargeCurrentMin, REG_ACCESS_RW, 4}, {eCh2_DischargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh2_Status, REG_ACCESS_RO, 4},
    // Channel 3
    {eCh3_Mode, REG_ACCESS_RW, 4}, {eCh3_ChargeVoltageMin, REG_ACCESS_RW, 4}, {eCh3_ChargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh3_DischargeVoltageMin, REG_ACCESS_RW, 4}, {eCh3_DischargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh3_ChargeCurrentMin, REG_ACCESS_RW, 4}, {eCh3_ChargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh3_DischargeCurrentMin, REG_ACCESS_RW, 4}, {eCh3_DischargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh3_Status, REG_ACCESS_RO, 4},
    // Channel 4
    {eCh4_Mode, REG_ACCESS_RW, 4}, {eCh4_ChargeVoltageMin, REG_ACCESS_RW, 4}, {eCh4_ChargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh4_DischargeVoltageMin, REG_ACCESS_RW, 4}, {eCh4_DischargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh4_ChargeCurrentMin, REG_ACCESS_RW, 4}, {eCh4_ChargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh4_DischargeCurrentMin, REG_ACCESS_RW, 4}, {eCh4_DischargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh4_Status, REG_ACCESS_RO, 4},
    // Channel 5
    {eCh5_Mode, REG_ACCESS_RW, 4}, {eCh5_ChargeVoltageMin, REG_ACCESS_RW, 4}, {eCh5_ChargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh5_DischargeVoltageMin, REG_ACCESS_RW, 4}, {eCh5_DischargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh5_ChargeCurrentMin, REG_ACCESS_RW, 4}, {eCh5_ChargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh5_DischargeCurrentMin, REG_ACCESS_RW, 4}, {eCh5_DischargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh5_Status, REG_ACCESS_RO, 4},
    // Channel 6
    {eCh6_Mode, REG_ACCESS_RW, 4}, {eCh6_ChargeVoltageMin, REG_ACCESS_RW, 4}, {eCh6_ChargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh6_DischargeVoltageMin, REG_ACCESS_RW, 4}, {eCh6_DischargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh6_ChargeCurrentMin, REG_ACCESS_RW, 4}, {eCh6_ChargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh6_DischargeCurrentMin, REG_ACCESS_RW, 4}, {eCh6_DischargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh6_Status, REG_ACCESS_RO, 4},
    // Channel 7
    {eCh7_Mode, REG_ACCESS_RW, 4}, {eCh7_ChargeVoltageMin, REG_ACCESS_RW, 4}, {eCh7_ChargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh7_DischargeVoltageMin, REG_ACCESS_RW, 4}, {eCh7_DischargeVoltageMax, REG_ACCESS_RW, 4},
    {eCh7_ChargeCurrentMin, REG_ACCESS_RW, 4}, {eCh7_ChargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh7_DischargeCurrentMin, REG_ACCESS_RW, 4}, {eCh7_DischargeCurrentMax, REG_ACCESS_RW, 4},
    {eCh7_Status, REG_ACCESS_RO, 4},
    // Stats Block
    {eCh0_CurrentAcc, REG_ACCESS_RO, 4}, {eCh0_MinVoltage, REG_ACCESS_RO, 4}, {eCh0_MaxVoltage, REG_ACCESS_RO, 4}, {eCh0_PowerAcc, REG_ACCESS_RO, 4},
    {eCh0_CellVoltage, REG_ACCESS_RO, 4}, {eCh0_CellCurrent, REG_ACCESS_RO, 4},
    {eCh1_CurrentAcc, REG_ACCESS_RO, 4}, {eCh1_MinVoltage, REG_ACCESS_RO, 4}, {eCh1_MaxVoltage, REG_ACCESS_RO, 4}, {eCh1_PowerAcc, REG_ACCESS_RO, 4},
    {eCh1_CellVoltage, REG_ACCESS_RO, 4}, {eCh1_CellCurrent, REG_ACCESS_RO, 4},
    {eCh2_CurrentAcc, REG_ACCESS_RO, 4}, {eCh2_MinVoltage, REG_ACCESS_RO, 4}, {eCh2_MaxVoltage, REG_ACCESS_RO, 4}, {eCh2_PowerAcc, REG_ACCESS_RO, 4},
    {eCh2_CellVoltage, REG_ACCESS_RO, 4}, {eCh2_CellCurrent, REG_ACCESS_RO, 4},
    {eCh3_CurrentAcc, REG_ACCESS_RO, 4}, {eCh3_MinVoltage, REG_ACCESS_RO, 4}, {eCh3_MaxVoltage, REG_ACCESS_RO, 4}, {eCh3_PowerAcc, REG_ACCESS_RO, 4},
    {eCh3_CellVoltage, REG_ACCESS_RO, 4}, {eCh3_CellCurrent, REG_ACCESS_RO, 4},
    {eCh4_CurrentAcc, REG_ACCESS_RO, 4}, {eCh4_MinVoltage, REG_ACCESS_RO, 4}, {eCh4_MaxVoltage, REG_ACCESS_RO, 4}, {eCh4_PowerAcc, REG_ACCESS_RO, 4},
    {eCh4_CellVoltage, REG_ACCESS_RO, 4}, {eCh4_CellCurrent, REG_ACCESS_RO, 4},
    {eCh5_CurrentAcc, REG_ACCESS_RO, 4}, {eCh5_MinVoltage, REG_ACCESS_RO, 4}, {eCh5_MaxVoltage, REG_ACCESS_RO, 4}, {eCh5_PowerAcc, REG_ACCESS_RO, 4},
    {eCh5_CellVoltage, REG_ACCESS_RO, 4}, {eCh5_CellCurrent, REG_ACCESS_RO, 4},
    {eCh6_CurrentAcc, REG_ACCESS_RO, 4}, {eCh6_MinVoltage, REG_ACCESS_RO, 4}, {eCh6_MaxVoltage, REG_ACCESS_RO, 4}, {eCh6_PowerAcc, REG_ACCESS_RO, 4},
    {eCh6_CellVoltage, REG_ACCESS_RO, 4}, {eCh6_CellCurrent, REG_ACCESS_RO, 4},
    {eCh7_CurrentAcc, REG_ACCESS_RO, 4}, {eCh7_MinVoltage, REG_ACCESS_RO, 4}, {eCh7_MaxVoltage, REG_ACCESS_RO, 4}, {eCh7_PowerAcc, REG_ACCESS_RO, 4},
    {eCh7_CellVoltage, REG_ACCESS_RO, 4}, {eCh7_CellCurrent, REG_ACCESS_RO, 4},
    // Calibration Block
    {eCh0_MinCellTemp, REG_ACCESS_RW, 4}, {eCh0_MaxCellTemp, REG_ACCESS_RW, 4},
    {eCh1_MinCellTemp, REG_ACCESS_RW, 4}, {eCh1_MaxCellTemp, REG_ACCESS_RW, 4},
    {eCh2_MinCellTemp, REG_ACCESS_RW, 4}, {eCh2_MaxCellTemp, REG_ACCESS_RW, 4},
    {eCh3_MinCellTemp, REG_ACCESS_RW, 4}, {eCh3_MaxCellTemp, REG_ACCESS_RW, 4},
    {eCh4_MinCellTemp, REG_ACCESS_RW, 4}, {eCh4_MaxCellTemp, REG_ACCESS_RW, 4},
    {eCh5_MinCellTemp, REG_ACCESS_RW, 4}, {eCh5_MaxCellTemp, REG_ACCESS_RW, 4},
    {eCh6_MinCellTemp, REG_ACCESS_RW, 4}, {eCh6_MaxCellTemp, REG_ACCESS_RW, 4},
    {eCh7_MinCellTemp, REG_ACCESS_RW, 4}, {eCh7_MaxCellTemp, REG_ACCESS_RW, 4},
    {eChargeDisableV, REG_ACCESS_RW, 4}, {eChargeRestrictV, REG_ACCESS_RW, 4},
    {eDischargeRestrictV, REG_ACCESS_RW, 4}, {eDischargeDisableV, REG_ACCESS_RW, 4},
    {eCh0_F28V_Gain, REG_ACCESS_RW, 4}, {eCh0_F28V_Offset, REG_ACCESS_RW, 4},
    {eCh0_F28I_Gain, REG_ACCESS_RW, 4}, {eCh0_F28I_Offset, REG_ACCESS_RW, 4},
    {eCh0_IoutGain_pu, REG_ACCESS_RW, 4}, {eCh0_IoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh0_IoutGain_A, REG_ACCESS_RW, 4}, {eCh0_IoutOffset_A, REG_ACCESS_RW, 4},
    {eCh0_VoutGain_pu, REG_ACCESS_RW, 4}, {eCh0_VoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh0_VoutGain_V, REG_ACCESS_RW, 4}, {eCh0_VoutOffset_V, REG_ACCESS_RW, 4},
    {eCh1_F28V_Gain, REG_ACCESS_RW, 4}, {eCh1_F28V_Offset, REG_ACCESS_RW, 4},
    {eCh1_F28I_Gain, REG_ACCESS_RW, 4}, {eCh1_F28I_Offset, REG_ACCESS_RW, 4},
    {eCh1_IoutGain_pu, REG_ACCESS_RW, 4}, {eCh1_IoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh1_IoutGain_A, REG_ACCESS_RW, 4}, {eCh1_IoutOffset_A, REG_ACCESS_RW, 4},
    {eCh1_VoutGain_pu, REG_ACCESS_RW, 4}, {eCh1_VoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh1_VoutGain_V, REG_ACCESS_RW, 4}, {eCh1_VoutOffset_V, REG_ACCESS_RW, 4},
    {eCh2_F28V_Gain, REG_ACCESS_RW, 4}, {eCh2_F28V_Offset, REG_ACCESS_RW, 4},
    {eCh2_F28I_Gain, REG_ACCESS_RW, 4}, {eCh2_F28I_Offset, REG_ACCESS_RW, 4},
    {eCh2_IoutGain_pu, REG_ACCESS_RW, 4}, {eCh2_IoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh2_IoutGain_A, REG_ACCESS_RW, 4}, {eCh2_IoutOffset_A, REG_ACCESS_RW, 4},
    {eCh2_VoutGain_pu, REG_ACCESS_RW, 4}, {eCh2_VoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh2_VoutGain_V, REG_ACCESS_RW, 4}, {eCh2_VoutOffset_V, REG_ACCESS_RW, 4},
    {eCh3_F28V_Gain, REG_ACCESS_RW, 4}, {eCh3_F28V_Offset, REG_ACCESS_RW, 4},
    {eCh3_F28I_Gain, REG_ACCESS_RW, 4}, {eCh3_F28I_Offset, REG_ACCESS_RW, 4},
    {eCh3_IoutGain_pu, REG_ACCESS_RW, 4}, {eCh3_IoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh3_IoutGain_A, REG_ACCESS_RW, 4}, {eCh3_IoutOffset_A, REG_ACCESS_RW, 4},
    {eCh3_VoutGain_pu, REG_ACCESS_RW, 4}, {eCh3_VoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh3_VoutGain_V, REG_ACCESS_RW, 4}, {eCh3_VoutOffset_V, REG_ACCESS_RW, 4},
    {eCh4_F28V_Gain, REG_ACCESS_RW, 4}, {eCh4_F28V_Offset, REG_ACCESS_RW, 4},
    {eCh4_F28I_Gain, REG_ACCESS_RW, 4}, {eCh4_F28I_Offset, REG_ACCESS_RW, 4},
    {eCh4_IoutGain_pu, REG_ACCESS_RW, 4}, {eCh4_IoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh4_IoutGain_A, REG_ACCESS_RW, 4}, {eCh4_IoutOffset_A, REG_ACCESS_RW, 4},
    {eCh4_VoutGain_pu, REG_ACCESS_RW, 4}, {eCh4_VoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh4_VoutGain_V, REG_ACCESS_RW, 4}, {eCh4_VoutOffset_V, REG_ACCESS_RW, 4},
    {eCh5_F28V_Gain, REG_ACCESS_RW, 4}, {eCh5_F28V_Offset, REG_ACCESS_RW, 4},
    {eCh5_F28I_Gain, REG_ACCESS_RW, 4}, {eCh5_F28I_Offset, REG_ACCESS_RW, 4},
    {eCh5_IoutGain_pu, REG_ACCESS_RW, 4}, {eCh5_IoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh5_IoutGain_A, REG_ACCESS_RW, 4}, {eCh5_IoutOffset_A, REG_ACCESS_RW, 4},
    {eCh5_VoutGain_pu, REG_ACCESS_RW, 4}, {eCh5_VoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh5_VoutGain_V, REG_ACCESS_RW, 4}, {eCh5_VoutOffset_V, REG_ACCESS_RW, 4},
    {eCh6_F28V_Gain, REG_ACCESS_RW, 4}, {eCh6_F28V_Offset, REG_ACCESS_RW, 4},
    {eCh6_F28I_Gain, REG_ACCESS_RW, 4}, {eCh6_F28I_Offset, REG_ACCESS_RW, 4},
    {eCh6_IoutGain_pu, REG_ACCESS_RW, 4}, {eCh6_IoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh6_IoutGain_A, REG_ACCESS_RW, 4}, {eCh6_IoutOffset_A, REG_ACCESS_RW, 4},
    {eCh6_VoutGain_pu, REG_ACCESS_RW, 4}, {eCh6_VoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh6_VoutGain_V, REG_ACCESS_RW, 4}, {eCh6_VoutOffset_V, REG_ACCESS_RW, 4},
    {eCh7_F28V_Gain, REG_ACCESS_RW, 4}, {eCh7_F28V_Offset, REG_ACCESS_RW, 4},
    {eCh7_F28I_Gain, REG_ACCESS_RW, 4}, {eCh7_F28I_Offset, REG_ACCESS_RW, 4},
    {eCh7_IoutGain_pu, REG_ACCESS_RW, 4}, {eCh7_IoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh7_IoutGain_A, REG_ACCESS_RW, 4}, {eCh7_IoutOffset_A, REG_ACCESS_RW, 4},
    {eCh7_VoutGain_pu, REG_ACCESS_RW, 4}, {eCh7_VoutOffset_pu, REG_ACCESS_RW, 4},
    {eCh7_VoutGain_V, REG_ACCESS_RW, 4}, {eCh7_VoutOffset_V, REG_ACCESS_RW, 4},
    {eCalibrationMode, REG_ACCESS_RW, 4},
    {eUnitState, REG_ACCESS_RO, 4},
    {eInputVoltage, REG_ACCESS_RO, 4},
    {eTripStatus, REG_ACCESS_RO, 4},
    // Measured Cell Temperatures
    {eCh0_CellTemp, REG_ACCESS_RO, 4}, {eCh1_CellTemp, REG_ACCESS_RO, 4},
    {eCh2_CellTemp, REG_ACCESS_RO, 4}, {eCh3_CellTemp, REG_ACCESS_RO, 4},
    {eCh4_CellTemp, REG_ACCESS_RO, 4}, {eCh5_CellTemp, REG_ACCESS_RO, 4},
    {eCh6_CellTemp, REG_ACCESS_RO, 4}, {eCh7_CellTemp, REG_ACCESS_RO, 4},
    // Slot grouping (MODE / ENABLE dip switches)
    {eSlotMode, REG_ACCESS_RO, 4}, {eSlotEnable, REG_ACCESS_RO, 4},
    {eGroupSize, REG_ACCESS_RO, 4}
};

